import re
# ret=re.sub('[a-z]+','sb',['武配齐是abc123','df王八蛋'],)
# print(ret)
# pattern = re.compile('您好！|您好，|你好,|您好,|你好，|谢谢，|谢谢。|朋友，|病情分析：|指导意见：|^。|。{2,}')
# pattern = re.compile('^[。\\！\\?\\,\，\.]{1,}')
# pattern1 = re.compile('(朋友|您好|你好|谢谢)(。|、|\？|,|，|\?|：|:|！|!|;|；)|^[^\u4e00-\u9fff]{1,}|(朋友|您好|你好|谢谢)|(情分析|指导意见|心理分析)(。|、|\？|,|，|\?|：|:|！|!|;|；)')
pattern1 =re.compile('指导意见.*')
def sub1(str):
    return  re.sub(pattern1,'',str)

ret1 = list(map(sub1,['您好。一般情况下当地正规的三甲医院治疗不孕不育都可以的。。。。。'
    ,'?你好，朋友，针对北京治疗精囊炎去哪里最好是这样的，',
    "病情分析：您好,您的情况是胃酸过多所致,铝碳酸镁（胃达喜片）不会引起萎缩性胃炎。",
                    "。,您好，肝硬化患者应多吃含高蛋白食物：",
                    "您好?肝硬化患者应多吃含高蛋白食物：",
                    "????您好肝硬化患者应多吃含高蛋白食物：",
                    "????您好肝硬化患者应多吃含高蛋白食物：谢谢！",
                      "甲状腺亢进疾病会体现在很多方面,例如容易冲动,易怒,精力过剩等.单凭一个手抖不能说明您是否患有甲亢.指导意见：手颤抖可能与您的神经系统有关,建议您不必有过大心理压力,放松心态.生活护理：祝您早日康复!"]))

pattern2 = re.compile('。{2,}')

def sub2(str):
    return  re.sub(pattern2,"。",str)

ret2 = list(map(sub2,ret1))

print(ret2)
